og_bench/opengauss_oltp_write_only_threads_8_time_60_tables_4_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 prepare >> opengauss_oltp_write_only_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest4'...
Creating table 'sbtest3'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest4'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 run >> opengauss_oltp_write_only_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 725.93 qps: 4356.86 (r/w/o: 0.00/2904.01/1452.85) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 748.73 qps: 4493.16 (r/w/o: 0.00/2995.61/1497.55) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 734.50 qps: 4407.11 (r/w/o: 0.00/2938.11/1469.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 742.47 qps: 4454.55 (r/w/o: 0.00/2969.60/1484.95) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 768.63 qps: 4611.77 (r/w/o: 0.00/3074.41/1537.36) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 745.01 qps: 4469.93 (r/w/o: 0.00/2979.92/1490.01) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           178639
        other:                           89327
        total:                           267966
    transactions:                        44661  (744.15 per sec.)
    queries:                             267966 (4464.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0151s
    total number of events:              44661

Latency (ms):
         min:                                    0.71
         avg:                                   10.75
         max:                                  163.48
         95th percentile:                       23.10
         sum:                               479950.88

Threads fairness:
    events (avg/stddev):           5582.6250/61.92
    execution time (avg/stddev):   59.9939/0.01

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 cleanup>> opengauss_oltp_write_only_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...