og_bench/opengauss_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> opengauss_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest4'...
Creating table 'sbtest5'...
Creating table 'sbtest8'...
Creating table 'sbtest7'...
Creating table 'sbtest2'...
Creating table 'sbtest3'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest5'
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest8'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest6'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> opengauss_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 627.31 qps: 3765.57 (r/w/o: 0.00/2510.15/1255.42) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 526.46 qps: 3159.08 (r/w/o: 0.00/2106.15/1052.93) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 559.40 qps: 3356.48 (r/w/o: 0.00/2237.59/1118.89) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 547.61 qps: 3285.76 (r/w/o: 0.00/2190.44/1095.32) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 654.24 qps: 3926.54 (r/w/o: 0.00/2618.06/1308.48) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 623.18 qps: 3738.09 (r/w/o: 0.00/2491.33/1246.76) lat (ms,95%): 26.20 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           141562
        other:                           70788
        total:                           212350
    transactions:                        35391  (589.62 per sec.)
    queries:                             212350 (3537.79 per sec.)
    ignored errors:                      1      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0223s
    total number of events:              35391

Latency (ms):
         min:                                    0.77
         avg:                                   13.56
         max:                                  186.43
         95th percentile:                       30.26
         sum:                               479974.00

Threads fairness:
    events (avg/stddev):           4423.8750/49.95
    execution time (avg/stddev):   59.9967/0.01

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup>> opengauss_oltp_write_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...