og_bench/opengauss_select_random_ranges_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_ranges --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> opengauss_select_random_ranges_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest2'...
Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest2'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql select_random_ranges --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> opengauss_select_random_ranges_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 10087.63 qps: 10087.63 (r/w/o: 10087.63/0.00/0.00) lat (ms,95%): 1.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 12851.61 qps: 12851.61 (r/w/o: 12851.61/0.00/0.00) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 11339.77 qps: 11339.77 (r/w/o: 11339.77/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 10724.19 qps: 10724.19 (r/w/o: 10724.19/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 10692.43 qps: 10692.43 (r/w/o: 10692.43/0.00/0.00) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 11305.95 qps: 11305.95 (r/w/o: 11305.95/0.00/0.00) lat (ms,95%): 1.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            670143
        write:                           0
        other:                           0
        total:                           670143
    transactions:                        670143 (11165.62 per sec.)
    queries:                             670143 (11165.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0173s
    total number of events:              670143

Latency (ms):
         min:                                    0.11
         avg:                                    0.71
         max:                                  164.40
         95th percentile:                        1.73
         sum:                               478648.13

Threads fairness:
    events (avg/stddev):           83767.8750/25738.65
    execution time (avg/stddev):   59.8310/0.05

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> opengauss_select_random_ranges_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...